/* AmigaGPT Say the OS version */
OPTIONS RESULTS

ADDRESS COMMAND

CMDLINE = 'c:version >t:AmigaGPTInput'

(CMDLINE)

IF OPEN(HANDLE,"t:AmigaGPTInput",'r') THEN DO
	INPUT = READLN(HANDLE)
	CALL CLOSE(HANDLE)
	ADDRESS COMMAND 'c:delete T:AmigaGPTInput QUIET'
END

ADDRESS 'AMIGAGPT'

'SPEAKTEXT 'INPUT

RETURN INPUT

EXIT
